{
    "metadata": {
        "organisation": "Royal Pharmaceutical Society (RPS)",
        "title": "A Competency Framework for all Prescribers",
        "short title": "RPS",
        "date": "2022",
        "source": "https://www.rpharms.com/resources/frameworks/prescribing-competency-framework/competency-framework"
    },
    "sections": [
        {
            "title": "The Consultation: Assess the patient",
            "capabilities": [
                {
                    "id": "1.1",
                    "description": "Undertakes the consultation in an appropriate setting. Appropriate setting includes location, environment and medium."
                },
                {
                    "id": "1.2",
                    "description": "Considers patient dignity, capacity, consent and confidentiality. In line with legislation, best practice, regulatory standards and contractual requirements."
                },
                {
                    "id": "1.3",
                    "description": "Introduces self and prescribing role to the patient/carer and confirms patient/carer identity."
                },
                {
                    "id": "1.4",
                    "description": "Assesses the communication needs of the patient/carer and adapts consultation appropriately. Adapts for language, age, capacity, learning disability and physical or sensory impairments."
                },
                {
                    "id": "1.5",
                    "description": "Demonstrates good consultation skills and builds rapport with the patient/carer. Good consultation skills include actively listening, using positive body language, asking open questions, remaining non-judgemental, and exploring the patient's/carer's ideas, concerns and expectations."
                },
                {
                    "id": "1.6",
                    "description": "Takes and documents an appropriate medical, psychosocial and medication history including allergies and intolerances. Medication history includes current and previously prescribed (and non-prescribed) medicines, vaccines, on-line medicines, over-the-counter medicines, vitamins, dietary supplements, herbal products, complementary remedies, recreational/illicit drugs, alcohol and tobacco."
                },
                {
                    "id": "1.7",
                    "description": "Undertakes and documents an appropriate clinical assessment. Clinical assessment includes observations, psychosocial assessments and physical examinations."
                },
                {
                    "id": "1.8",
                    "description": "Identifies and addresses potential vulnerabilities that may be causing the patient/carer to seek treatment. Safeguarding children and vulnerable adults (possible signs of abuse, neglect, or exploitation), and focusing on both the patient’s physical and mental health, particularly if vulnerabilities may lead them to seek treatment unnecessarily or for the wrong reasons."
                },
                {
                    "id": "1.9",
                    "description": "Accesses and interprets all available and relevant patient records to ensure knowledge of the patient’s management to date."
                },
                {
                    "id": "1.10",
                    "description": "Requests and interprets relevant investigations necessary to inform treatment options."
                },
                {
                    "id": "1.11",
                    "description": "Makes, confirms or understands, and documents the working or final diagnosis by systematically considering the various possibilities (differential diagnosis)."
                },
                {
                    "id": "1.12",
                    "description": "Understands the condition(s) being treated, their natural progression, and how to assess their severity, deterioration and anticipated response to treatment."
                },
                {
                    "id": "1.13",
                    "description": "Reviews adherence (and non-adherence) to, and effectiveness of, current medicines. Non-adherence may be intentional or non-intentional."
                },
                {
                    "id": "1.14",
                    "description": "Refers to or seeks guidance from another member of the team, a specialist or appropriate information source when necessary."
                }
            ]
        },
        {
            "title": "The Consultation: Identify evidence-based treatment options available for clinical decision making",
            "capabilities": [
                {
                    "id": "2.1",
                    "description": "Considers both non-pharmacological and pharmacological treatment approaches. Non-pharmacological approaches include lifestyle changes, diet and nutrition, physical activity and psychological approaches."
                },
                {
                    "id": "2.2",
                    "description": "Considers all pharmacological treatment options including optimising doses as well as stopping treatment (appropriate polypharmacy and deprescribing)."
                },
                {
                    "id": "2.3",
                    "description": "Assesses the risks and benefits to the patient of taking or not taking a medicine or treatment."
                },
                {
                    "id": "2.4",
                    "description": "Applies understanding of the pharmacokinetics and pharmacodynamics of medicines, and how these may be altered by individual patient factors. Patient factors include genetics, age, gender, ethnicity, hepatic and renal function, medical and medication history, smoking, pregnancy, breastfeeding, immunosuppression and disease progression."
                },
                {
                    "id": "2.5",
                    "description": "Assesses how co-morbidities, existing medicines, allergies, intolerances, contraindications and quality of life impact on management options."
                },
                {
                    "id": "2.6",
                    "description": "Considers any relevant patient factors and their potential impact on the choice and formulation of medicines, and the route of administration. Patient factors include ability to swallow, visual impairment, manual dexterity, cognition and system of medication-taking, health literacy, risk of self-harm and lifestyle."
                },
                {
                    "id": "2.7",
                    "description": "Accesses, critically evaluates, and uses reliable and validated sources of information."
                },
                {
                    "id": "2.8",
                    "description": "Stays up to date in own area of practice and applies the principles of evidence-based practice."
                },
                {
                    "id": "2.9",
                    "description": "Considers the wider perspective including the public health issues related to medicines and their use, and promoting health."
                },
                {
                    "id": "2.10",
                    "description": "Understands antimicrobial resistance and the roles of infection prevention, control and antimicrobial stewardship measures."
                }
            ]
        },
        {
            "title": "The Consultation: Present options and reach a shared decision",
            "capabilities": [
                {
                    "id": "3.1",
                    "description": "Actively involves and works with the patient/carer to make informed choices and agree a plan that respects the patient's/carer's preferences. Preferences include patient's/carer's right to decline or limit treatment."
                },
                {
                    "id": "3.2",
                    "description": "Considers and respects patient diversity, background, personal values and beliefs about their health, treatment and medicines, supporting the values of equality and inclusivity, and developing cultural competence. In line with legislation requirements which apply to equality, diversity and inclusion."
                },
                {
                    "id": "3.3",
                    "description": "Explains the material risks and benefits, and rationale behind management options in a way the patient/carer understands, so that they can make an informed choice."
                },
                {
                    "id": "3.4",
                    "description": "Assesses adherence in a non-judgemental way; understands the reasons for non-adherence and how best to support the patient/carer. Non-adherence may be intentional or non-intentional."
                },
                {
                    "id": "3.5",
                    "description": "Builds a relationship which encourages appropriate prescribing and not the expectation that a prescription will be supplied."
                },
                {
                    "id": "3.6",
                    "description": "Explores the patient's/carer's understanding of a consultation and aims for a satisfactory outcome for the patient/carer and prescriber."
                }
            ]
        },
        {
            "title": "The Consultation: Prescribe",
            "capabilities": [
                {
                    "id": "4.1",
                    "description": "Prescribes a medicine or device with up-to-date awareness of its actions, indications, dose, contraindications, interactions, cautions and adverse effects. 'Medicine' or 'device' includes all products (including necessary co-prescribing of infusion sets, devices, diluents and mediums) that can be prescribed, supplied or recommended for purchase."
                },
                {
                    "id": "4.2",
                    "description": "Understands the potential for adverse effects and takes steps to recognise, and manage them, whilst minimising risk."
                },
                {
                    "id": "4.3",
                    "description": "Understands and uses relevant national, regional and local frameworks for the use of medicines. Frameworks include local formularies, care pathways, protocols and professional guidelines, as well as evidence-based guidelines from relevant national, regional and local committees."
                },
                {
                    "id": "4.4",
                    "description": "Prescribes generic medicines where practical and safe for the patient, and knows when medicines should be prescribed by branded product."
                },
                {
                    "id": "4.5",
                    "description": "Accurately completes and routinely checks calculations relevant to prescribing and practical dosing."
                },
                {
                    "id": "4.6",
                    "description": "Prescribes appropriate quantities and at appropriate intervals necessary to reduce the risk of unnecessary waste. Amount necessary for a complete course, until next review or prescription supply."
                },
                {
                    "id": "4.7",
                    "description": "Recognises potential misuse of medicines; minimises risk and manages using appropriate processes. Minimises risk by ensuring appropriate safeguards are in place."
                },
                {
                    "id": "4.8",
                    "description": "Uses up-to-date information about the availability, pack sizes, storage conditions, excipients and costs of prescribed medicines."
                },
                {
                    "id": "4.9",
                    "description": "Electronically generates and/or writes legible, unambiguous and complete prescriptions which meet legal requirements."
                },
                {
                    "id": "4.10",
                    "description": "Effectively uses the systems necessary to prescribe medicines. Systems include medicine charts, decision support tools and electronic prescribing systems. Also, awareness and avoidance of potential system errors."
                },
                {
                    "id": "4.11",
                    "description": "Prescribes unlicensed and off-label medicines where legally permitted, and unlicensed medicines only if satisfied that an alternative licensed medicine would not meet the patient's clinical needs."
                },
                {
                    "id": "4.12",
                    "description": "Follows appropriate safeguards if prescribing medicines that are unlicensed, off-label, or outside standard practice."
                },
                {
                    "id": "4.13",
                    "description": "Documents accurate, legible and contemporaneous clinical records. Records include prescribing decisions, history, diagnosis, clinical indications, discussions, advice given, examinations, findings, interventions, action plans, safety-netting, referrals, monitoring and follow ups."
                },
                {
                    "id": "4.14",
                    "description": "Effectively and securely communicates information to other healthcare professionals involved in the patient's care, when sharing or transferring care and prescribing responsibilities, within and across all care settings. Information about clinical conditions, medicines and their current use (where necessary and with valid consent). Ensuring that private and personal data is protected and communicated securely in line with relevant legislation/regulations."
                }
            ]
        },
        {
            "title": "The Consultation: Provide information",
            "capabilities": [
                {
                    "id": "5.1",
                    "description": "Checks the patient's/carer's understanding of and commitment to the patient's management, monitoring and follow-up. Understanding includes clinical need, purpose, mode and timing of actions, precautions, identification and management of side effects, and implications of non-adherence."
                },
                {
                    "id": "5.2",
                    "description": "Gives the patient/carer clear, understandable and accessible information about their medicines. This could include indication, dose, interactions, timing, follow-up, side effects, mode of action and disposal of devices and unused medicines."
                },
                {
                    "id": "5.3",
                    "description": "Guides the patient/carer on how to identify reliable sources of information about their medicines and treatments."
                },
                {
                    "id": "5.4",
                    "description": "Ensures that the patient/carer knows what to do if there are any concerns about the management of their condition, if the condition deteriorates or if a side effect or adverse event occurs."
                },
                {
                    "id": "5.5",
                    "description": "When possible, encourages and supports patients/carers to take responsibility for their medicines and self-manage their conditions."
                }
            ]
        },
        {
            "title": "The Consultation: Monitor and review",
            "capabilities": [
                {
                    "id": "6.1",
                    "description": "Establishes and maintains a plan for reviewing the therapeutic objective, treatment and monitoring with the patient/carer. Monitoring includes ongoing, proactive review and recording of medicine benefits, adverse effects, safety and efficacy."
                },
                {
                    "id": "6.2",
                    "description": "Ensures that relevant monitoring of markers of health outcomes, side effects, adverse effects and safety have been carried out and recorded."
                },
                {
                    "id": "6.3",
                    "description": "Interprets and acts upon relevant monitoring markers of health outcomes, side effects, adverse effects and safety."
                },
                {
                    "id": "6.4",
                    "description": "Makes changes to the treatment plan in light of ongoing monitoring, the patient's condition and/or the patient's/carer's preferences."
                }
            ]
        },
        {
            "title": "Prescribing Governance: Prescribe safely",
            "capabilities": [
                {
                    "id": "7.1",
                    "description": "Prescribes within own scope of practice, recognises the limits of own knowledge and works within them. Including specialty and role-specific knowledge, skills, training, competence, experience and qualifications."
                },
                {
                    "id": "7.2",
                    "description": "Knows about common types and causes of medication errors, and how to prevent, avoid and detect them."
                },
                {
                    "id": "7.3",
                    "description": "Identifies the potential risks associated with prescribing via remote media and takes steps to minimise them. Remote media includes telephone, email, video link, remote access to healthcare records and online support tools (information and decision aids)."
                },
                {
                    "id": "7.4",
                    "description": "Minimises risks to patients by using or developing processes that support safe prescribing particularly in areas of high risk. Areas of high risk include transfer of information about medicines, prescribing of certain drugs with potential for harm (e.g., insulin, anticoagulants, cytotoxics, immunosuppressants), and prescribing for certain groups (e.g., children, older people, pregnant women, those with poor renal or liver function and vulnerable adults)."
                },
                {
                    "id": "7.5",
                    "description": "Keeps up to date about safety concerns related to specific medicines and products. Safety concerns include contraindications, cautions, side effects, adverse drug reactions, dosage, storage, disposal of medicines and medical devices."
                },
                {
                    "id": "7.6",
                    "description": "Reports adverse drug reactions, medication incidents and near misses, and reviews practice to prevent recurrence. Such events are reported to statutory organisations (including the MHRA Yellow Card scheme) and through appropriate local systems."
                }
            ]
        },
        {
            "title": "Prescribing Governance: Prescribe professionally",
            "capabilities": [
                {
                    "id": "8.1",
                    "description": "Ensures confidence and competence to prescribe are maintained. This is through continued professional development and reflective practice."
                },
                {
                    "id": "8.2",
                    "description": "Accepts personal responsibility and accountability for prescribing decisions, and understands the legal and ethical implications of prescribing. Including understanding the duplication of roles and responsibilities, shared decision-making, informed consent and maintaining professional boundaries."
                },
                {
                    "id": "8.3",
                    "description": "Makes prescribing decisions based on the needs of patients/carers and not the prescriber's personal considerations."
                },
                {
                    "id": "8.4",
                    "description": "Recognises and manages factors that influence prescribing decisions. Factors include conflicts of interest, e.g., pharmaceutical industry and commercial pressures, media pressures, personal beliefs, and any incentive schemes."
                },
                {
                    "id": "8.5",
                    "description": "Works within the health, social and organisational policies and procedures that impact on prescribing. Including policies and procedures relating to obtaining and recording consent; fraud; controlled drugs; local prescribing protocols; workforce development; multi-agency working; risk management; confidential record-keeping; incident reporting; and service development policies."
                },
                {
                    "id": "8.6",
                    "description": "Maintains confidentiality, safeguarding and protects patients and the public. In accordance with Information Governance requirements and current legal and organisational policies."
                }
            ]
        },
        {
            "title": "Prescribing Governance: Improve prescribing practice",
            "capabilities": [
                {
                    "id": "9.1",
                    "description": "Reflects on own and others' prescribing practice and acts upon feedback and discussion. Reflection being itself a professional requirement."
                },
                {
                    "id": "9.2",
                    "description": "Acts upon colleagues' inappropriate or unsafe prescribing practice using appropriate mechanisms. Mechanisms include prescribing practice audit and review tools, reporting through the relevant line management structure, or professional regulatory processes (e.g., whistle-blowing policies or raising patient safety concerns)."
                },
                {
                    "id": "9.3",
                    "description": "Understands and uses available tools to improve prescribing. Tools include formulary adherence, pharmacist review, prescribing data analysis, audit, patient feedback and regular meetings looking at where improvements can be made, and how to make them."
                },
                {
                    "id": "9.4",
                    "description": "Takes responsibility for own learning and continuing professional development relevant to the role. Learning and development can be both educational and organisational, formal and informal."
                },
                {
                    "id": "9.5",
                    "description": "Makes use of networks for support, reflection and learning."
                },
                {
                    "id": "9.6",
                    "description": "Learns from own and others' prescribing decisions, experiences and feedback. Including reflecting on published prescribing data and key performance indicators to identify and take action to improve practice."
                },
                {
                    "id": "9.7",
                    "description": "Takes part in, provides and acts on constructive feedback."
                }
            ]
        },
        {
            "title": "Prescribing Governance: Prescribe as part of a team",
            "capabilities": [
                {
                    "id": "10.1",
                    "description": "Works collaboratively as part of a multidisciplinary team to ensure that the transfer and continuity of care (within and across all care settings) is developed and not compromised. Working collaboratively may also include keeping the patient/carer informed or prescribing under a shared care protocol/agreement."
                },
                {
                    "id": "10.2",
                    "description": "Establishes relationships with other professionals based on understanding, trust, respect for each other's roles and an understanding of professional responsibility in relation to prescribing. Other professionals include those within and outside the prescriber's organisation."
                },
                {
                    "id": "10.3",
                    "description": "Provides support to other prescribers and team members where appropriate and acts as a resource for others. Support and acting as a resource may include information sharing; regular team updates; education; training; mentoring and developing networks."
                },
                {
                    "id": "10.4",
                    "description": "Provides information, advice and guidance about medicines which meets the needs of other prescribers and health and social care professionals. Advice may include any specific instructions for administration, advice to be given to the patient/carer and monitoring required immediately after administration."
                },
                {
                    "id": "10.5",
                    "description": "Negotiates the appropriate level of support and supervision for the role as a prescriber. By considering mentoring, leadership and workforce development (for example, becoming a Designated Prescribing Practitioner)."
                },
                {
                    "id": "10.6",
                    "description": "Takes into account the environmental impact of prescribing choices where possible. Methods of reducing a medicine's carbon footprint and environmental impact include proper disposal of medicine/device/equipment waste, recycling schemes, avoiding overprescribing and waste through regular reviews, deprescribing, dose and device optimisation."
                }
            ]
        }
    ]
}