{
    "metadata": {
        "organisation": "South West London and St. George's Mental Health Trust",
        "title": "Our Values and Behaviours Framework",
        "short title": "SWLStG Values",
        "date": "2023",
        "source": "https://swlstg.nhs.uk/our-vision-and-values"
    },
    "sections": [
        {
            "title": "Respectful",
            "capabilities": [
                {
                    "id": "1.1",
                    "description": "Appreciative: Notices and recognises others’ efforts. Goes out of their way to make others feel valued and heard. Praises behaviours over outcomes."
                },
                {
                    "id": "1.2",
                    "description": "Professional: Sets boundaries. Calm, patient, reassuring and puts people at ease. Takes responsibility and calls out when others are not."
                },
                {
                    "id": "1.3",
                    "description": "Fair: Ensure equity among staff and patients. Treats people as an equal and valued individual. Protects privacy and dignity of others."
                }
            ]
        },
        {
            "title": "Collaborative",
            "capabilities": [
                {
                    "id": "2.1",
                    "description": "Teamwork: Inclusive. Gets to know people, involves, encourages contributions. Connects people so they feel involved. Cooperates without hierarchy."
                },
                {
                    "id": "2.2",
                    "description": "Supportive: Is attentive to other people’s needs and feelings. Willing and helpful. Offers help when needed or finds someone else who can help."
                },
                {
                    "id": "2.3",
                    "description": "Innovative: High standards. Always looking to learn, and for better ways to do things. Is open and flexible to change and encourages this in others."
                }
            ]
        },
        {
            "title": "Compassionate",
            "capabilities": [
                {
                    "id": "3.1",
                    "description": "Shows empathy: Takes the time to understand and listen to issues or concerns. Puts themselves in other people’s shoes. Adjusts to different people."
                },
                {
                    "id": "3.2",
                    "description": "Kind: Notices and takes action when people are in pain, stressed or upset. Gives feedback when necessary in a safe, non-judgmental way."
                },
                {
                    "id": "3.3",
                    "description": "Listens: Takes time to make others feel listened to and supported. Values different perspectives. Takes other people’s views into consideration."
                }
            ]
        },
        {
            "title": "Open",
            "capabilities": [
                {
                    "id": "4.1",
                    "description": "Honest: Keeps people informed. Clear, open and honest communication. Ensures people get information in ways that they can understand."
                },
                {
                    "id": "4.2",
                    "description": "Optimistic: Shows a positive attitude when problem solving. Optimistic about what people can achieve. Encourages, not deterred by setbacks."
                },
                {
                    "id": "4.3",
                    "description": "Welcoming: Is approachable, polite, cheerful. Introduces themselves with ‘hello my name is…’ smiles and makes eye contact, when appropriate."
                }
            ]
        }
    ]
}